/**
 * Created by xiaofwa on 7/27/2015.
 */

var http = require("http");
var https = require("https");
var mongodb = require('mongodb');

var mongodbServer = new mongodb.Server('localhost', 27017, {auto_reconnect: true, poolSize: 10});
var db = new mongodb.Db('data', mongodbServer);
var handler = require("./dataHandler.js");
var flightList = [["阿克苏", "杭州"], ["阿克苏", "成都"], ["阿克苏", "青岛"], ["阿克苏", "上海"], ["阿克苏", "乌鲁木齐"], ["阿克苏", "西安"], ["阿勒泰", "乌鲁木齐"], ["安庆", "北京"], ["安庆", "海口"], ["安庆", "上海"], ["包头", "北京"], ["包头", "成都"], ["包头", "广州"], ["包头", "哈尔滨"], ["包头", "济南"], ["包头", "南京"], ["包头", "青岛"], ["包头", "三亚"], ["包头", "沈阳"], ["包头", "太原"], ["包头", "乌鲁木齐"], ["包头", "厦门"], ["包头", "郑州"], ["保山", "北京"], ["保山", "广州"], ["保山", "昆明"], ["北海", "北京"], ["北海", "长沙"], ["北海", "成都"], ["北海", "重庆"], ["北海", "广州"], ["北海", "贵阳"], ["北海", "哈尔滨"], ["北海", "昆明"], ["北海", "深圳"], ["北海", "上海"], ["北海", "西安"], ["北海", "郑州"], ["北海", "芷江"], ["北京", "长治"], ["北京", "长春"], ["北京", "长沙"], ["北京", "常州"], ["北京", "赤峰"], ["北京", "朝阳"], ["北京", "成都"], ["北京", "达州"], ["北京", "重庆"], ["北京", "东营"], ["北京", "大连"], ["北京", "大理"], ["北京", "敦煌"], ["北京", "大同"], ["北京", "恩施"], ["北京", "鄂尔多斯"], ["北京", "阜阳"], ["北京", "福州"], ["北京", "赣州"], ["北京", "广州"], ["北京", "桂林"], ["北京", "贵阳"], ["北京", "海口"], ["北京", "汉中"], ["北京", "海拉尔"], ["北京", "哈尔滨"], ["北京", "杭州"], ["北京", "合肥"], ["北京", "呼和浩特"], ["北京", "济南"], ["北京", "佳木斯"], ["北京", "嘉峪关"], ["北京", "景德镇"], ["北京", "鸡西"], ["北京", "晋江"], ["北京", "喀什"], ["北京", "库尔勒"], ["北京", "拉萨"], ["北京", "昆明"], ["北京", "丽江"], ["北京", "兰州"], ["北京", "连云港"], ["北京", "克拉玛依"], ["北京", "临沂"], ["北京", "泸州"], ["北京", "临沧"], ["北京", "洛阳"], ["北京", "满洲里"], ["北京", "绵阳"], ["北京", "芒市"], ["北京", "牡丹江"], ["北京", "漠河"], ["北京", "南昌"], ["北京", "南充"], ["北京", "南京"], ["北京", "南通"], ["北京", "南宁"], ["北京", "南阳"], ["北京", "宁波"], ["北京", "攀枝花"], ["北京", "齐齐哈尔"], ["北京", "衢州"], ["北京", "青岛"], ["北京", "三亚"], ["北京", "上海"], ["北京", "沈阳"], ["北京", "深圳"], ["北京", "台州"], ["北京", "铜仁"], ["北京", "通辽"], ["北京", "威海"], ["北京", "潍坊"], ["北京", "温州"], ["北京", "乌兰浩特"], ["北京", "乌海"], ["北京", "无锡"], ["北京", "乌鲁木齐"], ["北京", "文山"], ["北京", "武汉"], ["北京", "西安"], ["北京", "西双版纳"], ["北京", "西宁"], ["北京", "厦门"], ["北京", "兴义"], ["北京", "延安"], ["北京", "烟台"], ["北京", "伊宁"], ["北京", "延吉"], ["北京", "宜宾"], ["北京", "香格里拉"], ["北京", "宜昌"], ["北京", "银川"], ["北京", "义乌"], ["北京", "盐城"], ["北京", "榆林"], ["北京", "伊春"], ["北京", "张家界"], ["北京", "郑州"], ["北京", "舟山"], ["北京", "珠海"], ["北京", "芷江"], ["百色", "重庆"], ["百色", "广州"], ["百色", "桂林"], ["长春", "重庆"], ["长春", "长沙"], ["长春", "大连"], ["长春", "海拉尔"], ["长春", "福州"], ["长春", "广州"], ["长春", "杭州"], ["长春", "南京"], ["长春", "海口"], ["长春", "南宁"], ["长春", "宁波"], ["长春", "青岛"], ["长春", "深圳"], ["长春", "上海"], ["长春", "太原"], ["长春", "通辽"], ["长春", "威海"], ["长春", "武汉"], ["长春", "西安"], ["长春", "烟台"], ["长春", "石家庄"], ["长春", "合肥"], ["长春", "天津"], ["长春", "济南"], ["长春", "成都"], ["长春", "郑州"], ["长沙", "常州"], ["长沙", "成都"], ["长沙", "重庆"], ["长沙", "大理"], ["长春", "昆明"], ["长沙", "大连"], ["长沙", "福州"], ["长沙", "广州"], ["长沙", "哈尔滨"], ["长沙", "贵阳"], ["长沙", "杭州"], ["长沙", "海口"], ["长沙", "海拉尔"], ["长春", "贵阳"], ["长沙", "呼和浩特"], ["长沙", "济南"], ["长春", "珠海"], ["长沙", "晋江"], ["长沙", "拉萨"], ["长沙", "兰州"], ["长沙", "昆明"], ["长沙", "临沂"], ["长沙", "泸州"], ["长沙", "绵阳"], ["长沙", "南宁"], ["长沙", "南通"], ["长沙", "满洲里"], ["长沙", "青岛"], ["长沙", "三亚"], ["长沙", "深圳"], ["长沙", "宁波"], ["长沙", "上海"], ["长沙", "沈阳"], ["长沙", "台州"], ["长沙", "天津"], ["长春", "厦门"], ["长沙", "通辽"], ["长沙", "铜仁"], ["长沙", "西宁"], ["长沙", "厦门"], ["长沙", "温州"], ["长沙", "西安"], ["长沙", "丽江"], ["长沙", "烟台"], ["长沙", "乌鲁木齐"], ["长沙", "盐城"], ["长沙", "南京"], ["长沙", "银川"], ["长沙", "榆林"], ["长沙", "运城"], ["长沙", "西双版纳"], ["长沙", "永州"], ["长沙", "张家界"], ["长沙", "湛江"], ["长沙", "无锡"], ["长治", "重庆"], ["长治", "成都"], ["长治", "上海"], ["长治", "天津"], ["长治", "太原"], ["长治", "厦门"], ["常德", "海口"], ["常德", "昆明"], ["常德", "上海"], ["常州", "成都"], ["常州", "重庆"], ["常州", "大连"], ["常德", "深圳"], ["常州", "广州"], ["常州", "哈尔滨"], ["常州", "桂林"], ["常州", "兰州"], ["常州", "三亚"], ["常州", "深圳"], ["常州", "沈阳"], ["常州", "西安"], ["常州", "厦门"], ["常州", "宜昌"], ["常州", "银川"], ["成都", "昌都"], ["常州", "珠海"], ["成都", "大理"], ["成都", "大连"], ["成都", "敦煌"], ["成都", "东营"], ["成都", "福州"], ["成都", "赣州"], ["成都", "鄂尔多斯"], ["成都", "广州"], ["成都", "哈尔滨"], ["成都", "贵阳"], ["成都", "桂林"], ["成都", "海口"], ["成都", "邯郸"], ["成都", "杭州"], ["成都", "合肥"], ["成都", "呼和浩特"], ["成都", "济南"], ["成都", "济宁"], ["成都", "嘉峪关"], ["成都", "景德镇"], ["成都", "晋江"], ["成都", "喀什"], ["成都", "库尔勒"], ["成都", "兰州"], ["成都", "丽江"], ["成都", "连云港"], ["成都", "拉萨"], ["成都", "昆明"], ["成都", "临沂"], ["成都", "柳州"], ["成都", "洛阳"], ["成都", "南昌"], ["成都", "南通"], ["成都", "南宁"], ["成都", "南京"], ["成都", "宁波"], ["成都", "南阳"], ["成都", "攀枝花"], ["成都", "青岛"], ["成都", "三亚"], ["成都", "上海"], ["成都", "沈阳"], ["成都", "石家庄"], ["成都", "深圳"], ["成都", "太原"], ["成都", "台州"], ["成都", "天津"], ["成都", "万州"], ["成都", "温州"], ["成都", "乌海"], ["成都", "无锡"], ["成都", "乌鲁木齐"], ["成都", "武汉"], ["成都", "西安"], ["成都", "西宁"], ["成都", "西昌"], ["成都", "西双版纳"], ["成都", "厦门"], ["成都", "徐州"], ["成都", "香格里拉"], ["成都", "烟台"], ["成都", "伊宁"], ["成都", "宜昌"], ["成都", "运城"], ["成都", "玉树"], ["成都", "张家界"], ["成都", "昭通"], ["成都", "郑州"], ["成都", "珠海"], ["成都", "芷江"], ["赤峰", "哈尔滨"], ["赤峰", "海拉尔"], ["赤峰", "杭州"], ["赤峰", "呼和浩特"], ["赤峰", "上海"], ["赤峰", "沈阳"], ["赤峰", "天津"], ["重庆", "昌都"], ["重庆", "大连"], ["重庆", "敦煌"], ["重庆", "大理"], ["重庆", "福州"], ["重庆", "赣州"], ["重庆", "阜阳"], ["重庆", "桂林"], ["重庆", "贵阳"], ["重庆", "海口"], ["重庆", "合肥"], ["重庆", "哈尔滨"], ["重庆", "呼和浩特"], ["重庆", "杭州"], ["重庆", "济南"], ["重庆", "嘉峪关"], ["重庆", "晋江"], ["重庆", "库尔勒"], ["重庆", "广州"], ["重庆", "兰州"], ["重庆", "昆明"], ["重庆", "丽江"], ["重庆", "拉萨"], ["重庆", "洛阳"], ["重庆", "芒市"], ["重庆", "南昌"], ["重庆", "南京"], ["重庆", "南通"], ["重庆", "南宁"], ["重庆", "宁波"], ["重庆", "攀枝花"], ["重庆", "青岛"], ["重庆", "三亚"], ["重庆", "石家庄"], ["重庆", "深圳"], ["重庆", "沈阳"], ["重庆", "太原"], ["重庆", "上海"], ["重庆", "温州"], ["重庆", "柳州"], ["重庆", "万州"], ["重庆", "乌鲁木齐"], ["重庆", "武汉"], ["重庆", "无锡"], ["重庆", "梧州"], ["重庆", "西安"], ["重庆", "西宁"], ["重庆", "西昌"], ["重庆", "西双版纳"], ["重庆", "天津"], ["重庆", "香格里拉"], ["重庆", "徐州"], ["重庆", "厦门"], ["重庆", "延安"], ["重庆", "兴义"], ["重庆", "宜昌"], ["重庆", "义乌"], ["重庆", "银川"], ["重庆", "烟台"], ["重庆", "榆林"], ["重庆", "运城"], ["重庆", "湛江"], ["重庆", "张家界"], ["重庆", "昭通"], ["重庆", "郑州"], ["重庆", "珠海"], ["昌都", "拉萨"], ["达州", "广州"], ["达州", "昆明"], ["达州", "上海"], ["达州", "深圳"], ["大理", "广州"], ["大理", "杭州"], ["大理", "昆明"], ["大理", "南京"], ["大理", "上海"], ["大理", "深圳"], ["大理", "郑州"], ["大连", "东营"], ["大连", "福州"], ["大连", "广州"], ["大连", "桂林"], ["大连", "海拉尔"], ["大连", "贵阳"], ["大连", "杭州"], ["大连", "呼和浩特"], ["大连", "合肥"], ["大连", "济宁"], ["大连", "济南"], ["大连", "佳木斯"], ["大连", "黄山"], ["大连", "兰州"], ["大连", "连云港"], ["大连", "洛阳"], ["大连", "临沂"], ["大连", "昆明"], ["大连", "南京"], ["大连", "南宁"], ["大连", "牡丹江"], ["大连", "南阳"], ["大连", "宁波"], ["大连", "南通"], ["大连", "青岛"], ["大连", "石家庄"], ["大连", "天津"], ["大连", "太原"], ["大连", "上海"], ["大连", "深圳"], ["大连", "天水"], ["大连", "乌鲁木齐"], ["大连", "乌兰浩特"], ["大连", "无锡"], ["大连", "威海"], ["大连", "武汉"], ["大连", "南昌"], ["大连", "西安"], ["大连", "厦门"], ["大连", "延吉"], ["大连", "烟台"], ["大连", "齐齐哈尔"], ["大连", "温州"], ["大连", "伊春"], ["大连", "徐州"], ["大连", "珠海"], ["大连", "郑州"], ["大连", "三亚"], ["丹东", "上海"], ["丹东", "深圳"], ["东营", "杭州"], ["东营", "上海"], ["敦煌", "福州"], ["敦煌", "嘉峪关"], ["敦煌", "库尔勒"], ["敦煌", "兰州"], ["敦煌", "南京"], ["敦煌", "上海"], ["敦煌", "乌鲁木齐"], ["敦煌", "西安"], ["敦煌", "郑州"], ["大同", "哈尔滨"], ["大同", "呼和浩特"], ["大同", "昆明"], ["大同", "沈阳"], ["大同", "太原"], ["大同", "上海"], ["大同", "天津"], ["大同", "西安"], ["大同", "厦门"], ["大庆", "海拉尔"], ["大庆", "天津"], ["大庆", "武汉"], ["鄂尔多斯", "广州"], ["鄂尔多斯", "昆明"], ["鄂尔多斯", "上海"], ["鄂尔多斯", "沈阳"], ["鄂尔多斯", "哈尔滨"], ["鄂尔多斯", "西安"], ["鄂尔多斯", "西宁"], ["鄂尔多斯", "天津"], ["鄂尔多斯", "郑州"], ["恩施", "广州"], ["福州", "赣州"], ["福州", "广州"], ["福州", "哈尔滨"], ["福州", "贵阳"], ["福州", "桂林"], ["福州", "海拉尔"], ["福州", "杭州"], ["福州", "合肥"], ["福州", "呼和浩特"], ["福州", "济南"], ["恩施", "武汉"], ["福州", "景德镇"], ["福州", "拉萨"], ["福州", "临沂"], ["福州", "海口"], ["福州", "南宁"], ["福州", "南京"], ["福州", "兰州"], ["福州", "三亚"], ["福州", "沈阳"], ["福州", "石家庄"], ["福州", "深圳"], ["福州", "上海"], ["福州", "昆明"], ["福州", "青岛"], ["福州", "无锡"], ["福州", "西宁"], ["福州", "武汉"], ["福州", "西昌"], ["福州", "梧州"], ["福州", "西安"], ["福州", "乌鲁木齐"], ["福州", "天津"], ["福州", "太原"], ["福州", "徐州"], ["福州", "银川"], ["福州", "郑州"], ["阜阳", "杭州"], ["阜阳", "天津"], ["阜阳", "深圳"], ["阜阳", "厦门"], ["赣州", "杭州"], ["赣州", "昆明"], ["赣州", "海口"], ["赣州", "南昌"], ["赣州", "深圳"], ["赣州", "厦门"], ["格尔木", "拉萨"], ["格尔木", "西安"], ["格尔木", "西宁"], ["广州", "桂林"], ["广州", "海口"], ["广州", "贵阳"], ["广州", "哈尔滨"], ["广州", "邯郸"], ["广州", "呼和浩特"], ["广州", "合肥"], ["广州", "杭州"], ["广州", "佳木斯"], ["广州", "济南"], ["广州", "嘉峪关"], ["广州", "景德镇"], ["广州", "晋江"], ["广州", "锦州"], ["广州", "鸡西"], ["广州", "拉萨"], ["广州", "连云港"], ["广州", "丽江"], ["广州", "泸州"], ["广州", "昆明"], ["广州", "临沂"], ["广州", "绵阳"], ["广州", "梅县"], ["广州", "南京"], ["广州", "南宁"], ["广州", "牡丹江"], ["广州", "南充"], ["广州", "南通"], ["广州", "宁波"], ["广州", "齐齐哈尔"], ["广州", "三亚"], ["广州", "青岛"], ["广州", "南昌"], ["广州", "石家庄"], ["广州", "沈阳"], ["广州", "太原"], ["广州", "天津"], ["广州", "铜仁"], ["广州", "台州"], ["广州", "威海"], ["广州", "万州"], ["广州", "上海"], ["广州", "乌海"], ["广州", "潍坊"], ["广州", "温州"], ["广州", "无锡"], ["广州", "武夷山"], ["广州", "武汉"], ["广州", "西双版纳"], ["广州", "西安"], ["广州", "乌鲁木齐"], ["广州", "厦门"], ["广州", "兴义"], ["广州", "西宁"], ["广州", "烟台"], ["广州", "徐州"], ["广州", "延安"], ["广州", "盐城"], ["广州", "宜宾"], ["广州", "宜昌"], ["广州", "义乌"], ["广州", "银川"], ["广州", "芒市"], ["广州", "湛江"], ["广州", "郑州"], ["广州", "张家界"], ["贵阳", "哈尔滨"], ["广州", "兰州"], ["贵阳", "海口"], ["广州", "芷江"], ["贵阳", "济南"], ["贵阳", "呼和浩特"], ["贵阳", "昆明"], ["贵阳", "丽江"], ["贵阳", "兰州"], ["贵阳", "拉萨"], ["贵阳", "杭州"], ["贵阳", "南京"], ["贵阳", "南昌"], ["贵阳", "三亚"], ["贵阳", "青岛"], ["贵阳", "沈阳"], ["贵阳", "深圳"], ["贵阳", "石家庄"], ["贵阳", "太原"], ["贵阳", "天津"], ["贵阳", "上海"], ["贵阳", "铜仁"], ["贵阳", "温州"], ["贵阳", "乌鲁木齐"], ["贵阳", "西安"], ["贵阳", "武汉"], ["贵阳", "梧州"], ["贵阳", "无锡"], ["贵阳", "徐州"], ["贵阳", "烟台"], ["贵阳", "宜昌"], ["贵阳", "兴义"], ["贵阳", "湛江"], ["贵阳", "昭通"], ["桂林", "海口"], ["桂林", "哈尔滨"], ["贵阳", "珠海"], ["贵阳", "郑州"], ["桂林", "杭州"], ["桂林", "合肥"], ["桂林", "济南"], ["桂林", "昆明"], ["桂林", "南京"], ["贵阳", "厦门"], ["桂林", "南宁"], ["桂林", "三亚"], ["桂林", "沈阳"], ["桂林", "上海"], ["桂林", "石家庄"], ["桂林", "天津"], ["桂林", "西安"], ["桂林", "厦门"], ["桂林", "烟台"], ["桂林", "徐州"], ["桂林", "盐城"], ["桂林", "西宁"], ["桂林", "张家界"], ["哈尔滨", "海口"], ["哈尔滨", "海拉尔"], ["哈尔滨", "杭州"], ["桂林", "郑州"], ["哈尔滨", "黑河"], ["哈尔滨", "合肥"], ["哈尔滨", "济南"], ["哈尔滨", "鸡西"], ["哈尔滨", "佳木斯"], ["哈尔滨", "昆明"], ["哈尔滨", "临沂"], ["哈尔滨", "呼和浩特"], ["哈尔滨", "连云港"], ["哈尔滨", "漠河"], ["哈尔滨", "南通"], ["哈尔滨", "南京"], ["哈尔滨", "三亚"], ["哈尔滨", "青岛"], ["哈尔滨", "深圳"], ["哈尔滨", "天津"], ["哈尔滨", "太原"], ["哈尔滨", "通辽"], ["哈尔滨", "温州"], ["哈尔滨", "上海"], ["哈尔滨", "无锡"], ["哈尔滨", "武汉"], ["桂林", "太原"], ["哈尔滨", "厦门"], ["哈尔滨", "西安"], ["哈尔滨", "徐州"], ["哈尔滨", "烟台"], ["哈尔滨", "盐城"], ["哈尔滨", "运城"], ["哈尔滨", "伊春"], ["哈尔滨", "郑州"], ["海口", "丽江"], ["海口", "昆明"], ["海口", "兰州"], ["海口", "泸州"], ["海口", "合肥"], ["海口", "南昌"], ["海口", "济宁"], ["海口", "南宁"], ["海口", "青岛"], ["海口", "梅县"], ["海口", "沈阳"], ["海口", "石家庄"], ["海口", "太原"], ["海口", "济南"], ["海口", "上海"], ["海口", "万州"], ["海口", "天津"], ["海口", "乌鲁木齐"], ["海口", "武汉"], ["海口", "厦门"], ["海口", "西安"], ["海口", "杭州"], ["海口", "郑州"], ["海口", "珠海"], ["海口", "芷江"], ["海口", "深圳"], ["海拉尔", "呼和浩特"], ["海拉尔", "杭州"], ["海拉尔", "南宁"], ["海拉尔", "南京"], ["海拉尔", "青岛"], ["海拉尔", "上海"], ["海拉尔", "天津"], ["海拉尔", "深圳"], ["海拉尔", "通辽"], ["海拉尔", "厦门"], ["海口", "运城"], ["海拉尔", "烟台"], ["海拉尔", "济南"], ["汉中", "西安"], ["汉中", "上海"], ["杭州", "呼和浩特"], ["杭州", "晋江"], ["杭州", "兰州"], ["杭州", "洛阳"], ["杭州", "临沂"], ["杭州", "芒市"], ["杭州", "满洲里"], ["杭州", "绵阳"], ["杭州", "南宁"], ["杭州", "南阳"], ["杭州", "泸州"], ["杭州", "昆明"], ["杭州", "三亚"], ["杭州", "太原"], ["杭州", "铜仁"], ["杭州", "沈阳"], ["杭州", "拉萨"], ["杭州", "潍坊"], ["杭州", "天津"], ["杭州", "石家庄"], ["杭州", "青岛"], ["杭州", "武汉"], ["杭州", "深圳"], ["杭州", "西双版纳"], ["杭州", "厦门"], ["杭州", "西安"], ["杭州", "西宁"], ["杭州", "西昌"], ["杭州", "乌鲁木齐"], ["杭州", "烟台"], ["杭州", "宜昌"], ["杭州", "宜宾"], ["杭州", "张家界"], ["杭州", "银川"], ["杭州", "珠海"], ["杭州", "郑州"], ["杭州", "通辽"], ["合肥", "济宁"], ["合肥", "昆明"], ["合肥", "兰州"], ["杭州", "锦州"], ["合肥", "三亚"], ["合肥", "上海"], ["合肥", "深圳"], ["合肥", "太原"], ["合肥", "沈阳"], ["合肥", "威海"], ["合肥", "乌鲁木齐"], ["合肥", "西宁"], ["合肥", "西安"], ["合肥", "厦门"], ["合肥", "烟台"], ["杭州", "丽江"], ["合肥", "银川"], ["合肥", "运城"], ["黑河", "漠河"], ["黑河", "上海"], ["呼和浩特", "济南"], ["呼和浩特", "兰州"], ["呼和浩特", "昆明"], ["呼和浩特", "南宁"], ["呼和浩特", "南京"], ["呼和浩特", "青岛"], ["呼和浩特", "上海"], ["呼和浩特", "沈阳"], ["呼和浩特", "深圳"], ["呼和浩特", "石家庄"], ["呼和浩特", "太原"], ["呼和浩特", "天津"], ["呼和浩特", "通辽"], ["呼和浩特", "乌海"], ["呼和浩特", "乌兰浩特"], ["呼和浩特", "乌鲁木齐"], ["呼和浩特", "武汉"], ["呼和浩特", "西安"], ["呼和浩特", "厦门"], ["呼和浩特", "锡林浩特"], ["呼和浩特", "烟台"], ["呼和浩特", "银川"], ["呼和浩特", "榆林"], ["呼和浩特", "郑州"], ["黄山", "青岛"], ["黄山", "深圳"], ["黄山", "太原"], ["黄山", "西安"], ["黄山", "厦门"], ["济南", "晋江"], ["济南", "喀什"], ["济南", "库尔勒"], ["济南", "昆明"], ["济南", "兰州"], ["济南", "南昌"], ["济南", "南宁"], ["济南", "上海"], ["济南", "沈阳"], ["济南", "深圳"], ["济南", "太原"], ["济南", "三亚"], ["济南", "乌鲁木齐"], ["济南", "武汉"], ["济南", "西安"], ["济南", "温州"], ["济南", "厦门"], ["济南", "烟台"], ["济南", "银川"], ["济南", "郑州"], ["济南", "珠海"], ["济宁", "沈阳"], ["济宁", "天津"], ["济宁", "烟台"], ["佳木斯", "深圳"], ["佳木斯", "上海"], ["嘉峪关", "昆明"], ["嘉峪关", "兰州"], ["嘉峪关", "上海"], ["嘉峪关", "乌鲁木齐"], ["嘉峪关", "西安"], ["锦州", "青岛"], ["井冈山", "南昌"], ["井冈山", "南京"], ["井冈山", "深圳"], ["井冈山", "西安"], ["井冈山", "天津"], ["景德镇", "上海"], ["景德镇", "深圳"], ["景德镇", "西安"], ["景德镇", "厦门"], ["晋江", "昆明"], ["晋江", "南宁"], ["晋江", "南京"], ["晋江", "上海"], ["晋江", "三亚"], ["晋江", "深圳"], ["晋江", "石家庄"], ["晋江", "天津"], ["晋江", "沈阳"], ["晋江", "武汉"], ["晋江", "武夷山"], ["晋江", "西安"], ["晋江", "西宁"], ["晋江", "郑州"], ["晋江", "舟山"], ["鸡西", "沈阳"], ["晋江", "义乌"], ["喀什", "上海"], ["喀什", "深圳"], ["喀什", "乌鲁木齐"], ["喀什", "西安"], ["库尔勒", "西安"], ["库尔勒", "乌鲁木齐"], ["库尔勒", "郑州"], ["昆明", "兰州"], ["昆明", "拉萨"], ["昆明", "丽江"], ["昆明", "临沧"], ["昆明", "泸州"], ["昆明", "洛阳"], ["昆明", "绵阳"], ["昆明", "芒市"], ["昆明", "南昌"], ["昆明", "南充"], ["昆明", "南京"], ["昆明", "南阳"], ["昆明", "宁波"], ["昆明", "南通"], ["昆明", "南宁"], ["昆明", "青岛"], ["昆明", "三亚"], ["昆明", "石家庄"], ["昆明", "太原"], ["昆明", "台州"], ["昆明", "上海"], ["昆明", "深圳"], ["昆明", "天津"], ["昆明", "铜仁"], ["昆明", "万州"], ["昆明", "沈阳"], ["昆明", "文山"], ["昆明", "温州"], ["昆明", "无锡"], ["昆明", "武夷山"], ["昆明", "乌鲁木齐"], ["昆明", "武汉"], ["昆明", "西宁"], ["昆明", "西双版纳"], ["昆明", "厦门"], ["昆明", "香格里拉"], ["昆明", "徐州"], ["昆明", "兴义"], ["昆明", "西安"], ["昆明", "盐城"], ["昆明", "宜昌"], ["昆明", "宜宾"], ["昆明", "烟台"], ["昆明", "榆林"], ["昆明", "银川"], ["昆明", "永州"], ["昆明", "湛江"], ["昆明", "张家界"], ["昆明", "郑州"], ["昆明", "珠海"], ["昆明", "运城"], ["昆明", "芷江"], ["昆明", "昭通"], ["克拉玛依", "乌鲁木齐"], ["克拉玛依", "伊宁"], ["拉萨", "丽江"], ["拉萨", "兰州"], ["拉萨", "南京"], ["拉萨", "深圳"], ["拉萨", "上海"], ["拉萨", "西安"], ["拉萨", "西宁"], ["拉萨", "厦门"], ["拉萨", "香格里拉"], ["拉萨", "宜宾"], ["兰州", "南京"], ["兰州", "南宁"], ["兰州", "南昌"], ["兰州", "宁波"], ["兰州", "青岛"], ["兰州", "三亚"], ["兰州", "上海"], ["兰州", "深圳"], ["兰州", "沈阳"], ["兰州", "温州"], ["兰州", "无锡"], ["兰州", "武汉"], ["兰州", "乌鲁木齐"], ["兰州", "西安"], ["兰州", "厦门"], ["兰州", "义乌"], ["兰州", "银川"], ["兰州", "榆林"], ["兰州", "张家界"], ["兰州", "郑州"], ["兰州", "珠海"], ["丽江", "绵阳"], ["丽江", "南京"], ["丽江", "南宁"], ["丽江", "沈阳"], ["丽江", "上海"], ["丽江", "石家庄"], ["丽江", "深圳"], ["丽江", "天津"], ["丽江", "武汉"], ["丽江", "西安"], ["丽江", "西双版纳"], ["丽江", "宜宾"], ["丽江", "郑州"], ["连云港", "沈阳"], ["连云港", "天津"], ["连云港", "厦门"], ["连云港", "张家界"], ["临沂", "南宁"], ["临沧", "郑州"], ["临沂", "宁波"], ["临沂", "深圳"], ["临沂", "沈阳"], ["临沂", "天津"], ["临沂", "温州"], ["临沂", "西安"], ["临沂", "厦门"], ["柳州", "深圳"], ["柳州", "上海"], ["柳州", "珠海"], ["泸州", "西安"], ["泸州", "厦门"], ["洛阳", "三亚"], ["泸州", "深圳"], ["洛阳", "沈阳"], ["洛阳", "石家庄"], ["洛阳", "银川"], ["满洲里", "上海"], ["满洲里", "通辽"], ["芒市", "深圳"], ["芒市", "西安"], ["芒市", "西双版纳"], ["绵阳", "南京"], ["绵阳", "南宁"], ["绵阳", "青岛"], ["绵阳", "三亚"], ["绵阳", "上海"], ["绵阳", "石家庄"], ["绵阳", "乌鲁木齐"], ["绵阳", "银川"], ["绵阳", "西宁"], ["绵阳", "厦门"], ["绵阳", "沈阳"], ["绵阳", "深圳"], ["绵阳", "郑州"], ["牡丹江", "深圳"], ["牡丹江", "青岛"], ["绵阳", "西安"], ["牡丹江", "上海"], ["梅县", "上海"], ["梅县", "深圳"], ["梅县", "天津"], ["梅县", "郑州"], ["梅县", "珠海"], ["漠河", "上海"], ["南昌", "三亚"], ["南昌", "青岛"], ["南昌", "深圳"], ["南昌", "沈阳"], ["南昌", "上海"], ["南昌", "太原"], ["南昌", "天津"], ["南昌", "温州"], ["南昌", "乌鲁木齐"], ["南昌", "厦门"], ["南昌", "西安"], ["南昌", "银川"], ["南昌", "珠海"], ["南充", "上海"], ["南充", "三亚"], ["南充", "西安"], ["南京", "青岛"], ["南京", "三亚"], ["南京", "上海"], ["南京", "南宁"], ["南京", "太原"], ["南京", "石家庄"], ["南京", "深圳"], ["南京", "乌鲁木齐"], ["南京", "沈阳"], ["南京", "威海"], ["南京", "西宁"], ["南京", "西双版纳"], ["南京", "厦门"], ["南京", "伊宁"], ["南京", "西安"], ["南京", "烟台"], ["南京", "运城"], ["南京", "张家界"], ["南京", "珠海"], ["南宁", "宁波"], ["南京", "银川"], ["南宁", "三亚"], ["南宁", "沈阳"], ["南宁", "石家庄"], ["南宁", "上海"], ["南宁", "太原"], ["南宁", "深圳"], ["南宁", "青岛"], ["南宁", "温州"], ["南宁", "乌鲁木齐"], ["南宁", "武汉"], ["南宁", "厦门"], ["南宁", "义乌"], ["南宁", "西安"], ["南宁", "银川"], ["南宁", "烟台"], ["南宁", "榆林"], ["南宁", "珠海"], ["南宁", "郑州"], ["南昌", "南宁"], ["南通", "青岛"], ["南通", "沈阳"], ["南通", "深圳"], ["南通", "天津"], ["南通", "武汉"], ["南通", "厦门"], ["南阳", "上海"], ["宁波", "青岛"], ["南通", "西安"], ["宁波", "三亚"], ["宁波", "石家庄"], ["宁波", "深圳"], ["宁波", "天津"], ["宁波", "武汉"], ["宁波", "西安"], ["宁波", "厦门"], ["宁波", "宜昌"], ["宁波", "银川"], ["宁波", "珠海"], ["齐齐哈尔", "上海"], ["齐齐哈尔", "深圳"], ["秦皇岛", "青岛"], ["秦皇岛", "上海"], ["秦皇岛", "石家庄"], ["青岛", "深圳"], ["青岛", "沈阳"], ["青岛", "上海"], ["青岛", "石家庄"], ["青岛", "太原"], ["青岛", "天津"], ["青岛", "温州"], ["青岛", "乌鲁木齐"], ["青岛", "武汉"], ["青岛", "武夷山"], ["青岛", "西安"], ["青岛", "西宁"], ["青岛", "厦门"], ["青岛", "延吉"], ["青岛", "宜昌"], ["青岛", "银川"], ["青岛", "张家界"], ["青岛", "郑州"], ["衢州", "深圳"], ["衢州", "厦门"], ["三亚", "深圳"], ["三亚", "上海"], ["三亚", "沈阳"], ["三亚", "石家庄"], ["三亚", "太原"], ["三亚", "天津"], ["三亚", "温州"], ["三亚", "无锡"], ["三亚", "乌鲁木齐"], ["三亚", "武汉"], ["三亚", "西安"], ["三亚", "西宁"], ["三亚", "厦门"], ["三亚", "徐州"], ["三亚", "宜宾"], ["三亚", "湛江"], ["三亚", "郑州"], ["三亚", "珠海"], ["三亚", "运城"], ["上海", "沈阳"], ["上海", "深圳"], ["上海", "石家庄"], ["上海", "天津"], ["上海", "铜仁"], ["上海", "通辽"], ["上海", "万州"], ["上海", "威海"], ["上海", "潍坊"], ["上海", "温州"], ["上海", "乌鲁木齐"], ["上海", "武夷山"], ["上海", "西昌"], ["上海", "乌海"], ["上海", "武汉"], ["上海", "西宁"], ["上海", "香格里拉"], ["上海", "厦门"], ["上海", "兴义"], ["上海", "延安"], ["上海", "烟台"], ["上海", "盐城"], ["上海", "延吉"], ["上海", "西安"], ["上海", "太原"], ["上海", "宜宾"], ["上海", "宜昌"], ["上海", "银川"], ["上海", "运城"], ["上海", "榆林"], ["上海", "伊春"], ["上海", "张家界"], ["上海", "湛江"], ["上海", "郑州"], ["上海", "芷江"], ["上海", "西双版纳"], ["上海", "珠海"], ["深圳", "石家庄"], ["深圳", "沈阳"], ["深圳", "太原"], ["深圳", "台州"], ["深圳", "通辽"], ["深圳", "天津"], ["深圳", "铜仁"], ["深圳", "万州"], ["深圳", "潍坊"], ["深圳", "温州"], ["深圳", "无锡"], ["深圳", "武汉"], ["深圳", "乌鲁木齐"], ["深圳", "西宁"], ["深圳", "西安"], ["深圳", "厦门"], ["深圳", "徐州"], ["深圳", "烟台"], ["深圳", "兴义"], ["深圳", "盐城"], ["深圳", "宜宾"], ["深圳", "宜昌"], ["深圳", "义乌"], ["深圳", "银川"], ["深圳", "永州"], ["深圳", "运城"], ["深圳", "湛江"], ["深圳", "张家界"], ["深圳", "芷江"], ["深圳", "郑州"], ["沈阳", "石家庄"], ["沈阳", "太原"], ["沈阳", "潍坊"], ["沈阳", "温州"], ["沈阳", "天津"], ["沈阳", "乌鲁木齐"], ["沈阳", "无锡"], ["沈阳", "武汉"], ["沈阳", "西安"], ["沈阳", "西宁"], ["沈阳", "厦门"], ["沈阳", "徐州"], ["沈阳", "烟台"], ["沈阳", "延吉"], ["沈阳", "盐城"], ["沈阳", "义乌"], ["沈阳", "张家界"], ["沈阳", "珠海"], ["沈阳", "郑州"], ["石家庄", "温州"], ["石家庄", "乌鲁木齐"], ["石家庄", "西安"], ["石家庄", "西宁"], ["石家庄", "厦门"], ["石家庄", "烟台"], ["石家庄", "银川"], ["石家庄", "榆林"], ["石家庄", "张家界"], ["石家庄", "珠海"], ["塔城", "乌鲁木齐"], ["太原", "天津"], ["太原", "乌鲁木齐"], ["太原", "武汉"], ["太原", "西安"], ["太原", "厦门"], ["太原", "徐州"], ["太原", "榆林"], ["台州", "武汉"], ["天津", "天水"], ["天津", "乌鲁木齐"], ["天津", "武汉"], ["天津", "西安"], ["天津", "西双版纳"], ["天津", "厦门"], ["天津", "烟台"], ["天津", "延吉"], ["天津", "盐城"], ["天津", "榆林"], ["天津", "运城"], ["天津", "张家界"], ["天津", "湛江"], ["天津", "郑州"], ["天津", "珠海"], ["通辽", "西安"], ["铜仁", "厦门"], ["天水", "西安"], ["万州", "厦门"], ["万州", "西安"], ["温州", "西安"], ["温州", "武汉"], ["温州", "银川"], ["温州", "张家界"], ["温州", "郑州"], ["温州", "珠海"], ["乌海", "西安"], ["乌鲁木齐", "武汉"], ["乌鲁木齐", "西安"], ["乌鲁木齐", "厦门"], ["乌鲁木齐", "伊宁"], ["乌鲁木齐", "银川"], ["乌鲁木齐", "郑州"], ["无锡", "武汉"], ["无锡", "西安"], ["无锡", "厦门"], ["无锡", "银川"], ["武汉", "西安"], ["武汉", "西宁"], ["武汉", "厦门"], ["武汉", "烟台"], ["武汉", "盐城"], ["武汉", "张家界"], ["武汉", "珠海"], ["武夷山", "厦门"], ["梧州", "义乌"], ["西安", "西宁"], ["西安", "锡林浩特"], ["西安", "厦门"], ["西安", "延安"], ["西安", "烟台"], ["西安", "盐城"], ["西安", "伊宁"], ["西安", "宜宾"], ["西安", "宜昌"], ["西安", "义乌"], ["西安", "银川"], ["西安", "榆林"], ["西安", "张家界"], ["西安", "湛江"], ["西安", "芷江"], ["西安", "珠海"], ["西安", "玉树"], ["西宁", "玉树"], ["厦门", "徐州"], ["厦门", "宜宾"], ["厦门", "烟台"], ["厦门", "宜昌"], ["厦门", "榆林"], ["厦门", "运城"], ["厦门", "盐城"], ["厦门", "舟山"], ["厦门", "珠海"], ["厦门", "义乌"], ["厦门", "郑州"], ["银川", "榆林"], ["银川", "张家界"], ["银川", "郑州"], ["榆林", "郑州"], ["运城", "郑州"], ["郑州", "珠海"]];

var endList = ["BJS", "SHA", "CAN", "SZX", "CTU", "HGH", "WUH", "SIA", "CKG", "TAO", "CSX", "NKG", "XMN", "KMG", "DLC", "TSN", "CGO", "SYX", "TNA", "FOC", "AAT", "AKA", "AKU", "AOG", "AQG", "AVA", "AXF", "NGQ", "RHT", "YIE", "AEB", "BAV", "BFJ", "BHY", "BPL", "BSD", "BJS", "RLK", "BJS", "BJS", "BPX", "CGD", "CGQ", "CHG", "CIF", "CIH", "CKG", "CNI", "CSX", "CTU", "CZX", "JUH", "NBS", "DAT", "DAX", "DCY", "DDG", "DIG", "DLC", "DLU", "DNH", "DOY", "DQA", "HXD", "LUM", "DSN", "EJN", "ENH", "ERL", "FOC", "FUG", "FUO", "FYJ", "CAN", "GHN", "GOQ", "GYS", "GYU", "KOW", "KWE", "KWL", "LHK", "AHJ", "HAK", "HCJ", "HDG", "HEK", "HET", "HFE", "HGH", "HIA", "HJJ", "HLD", "HMI", "HRB", "HTN", "HZG", "TXN", "JDZ", "JGD", "JGN", "JGS", "JIC", "JIU", "JJN", "JMU", "JNG", "JNZ", "JXA", "JZH", "SWA", "TNA", "KCA", "KGT", "KHG", "KJH", "KJI", "KMG", "KRL", "KRY", "HZH", "LCX", "LHW", "LIA", "LJG", "LLB", "LLV", "LNJ", "LXA", "LXI", "LYA", "LYG", "LYI", "LZH", "LZO", "LZY", "MDG", "MIG", "MXZ", "NZH", "OHE", "KHN", "NAO", "NGB", "NKG", "NLT", "NNG", "NNY", "NTG", "PZI", "SYM", "IQM", "IQN", "JIQ", "JUZ", "NDG", "SHP", "TAO", "RKZ", "HPG", "SHA", "SHE", "SHS", "SJW", "SYX", "SZX", "SHA", "SHA", "HYN", "TCG", "TCZ", "TEN", "TGO", "THQ", "TLQ", "TNH", "TSN", "TVS", "TYN", "HLH", "URC", "WEF", "WEH", "WNH", "WNZ", "WUA", "WUH", "WUS", "WUX", "WUZ", "WXN", "ACX", "GXH", "JHG", "XFN", "XIC", "XIL", "SIA", "XMN", "XNN", "XUZ", "ENY", "INC", "LDS", "LLF", "UYN", "YBP", "YCU", "YIC", "YIH", "YIN", "YIW", "YNJ", "YNT", "YNZ", "YTY", "YUS", "CGO", "DYG", "HSN", "YZY", "ZAT", "ZGN", "ZHA", "ZHY", "ZQZ", "ZUH", "ZYI"];

var nameMap = {
    "阿勒泰": "AAT",
    "安康": "AKA",
    "阿克苏": "AKU",
    "鞍山": "AOG",
    "安庆": "AQG",
    "安顺": "AVA",
    "阿拉善左旗": "AXF",
    "阿里": "NGQ",
    "阿拉善右旗": "RHT",
    "阿尔山": "YIE",
    "百色": "AEB",
    "包头": "BAV",
    "毕节": "BFJ",
    "北海": "BHY",
    "博乐": "BPL",
    "保山": "BSD",
    "北京": "BJS",
    "巴彦淖尔": "RLK",
    "北京(南苑)": "BJS",
    "北京(首都)": "BJS",
    "昌都": "BPX",
    "常德": "CGD",
    "长春": "CGQ",
    "朝阳": "CHG",
    "赤峰": "CIF",
    "长治": "CIH",
    "重庆": "CKG",
    "长海": "CNI",
    "长沙": "CSX",
    "成都": "CTU",
    "常州": "CZX",
    "池州": "JUH",
    "长白山": "NBS",
    "大同": "DAT",
    "达县": "DAX",
    "稻城": "DCY",
    "丹东": "DDG",
    "迪庆": "DIG",
    "大连": "DLC",
    "大理市": "DLU",
    "敦煌": "DNH",
    "东营": "DOY",
    "大庆": "DQA",
    "德令哈": "HXD",
    "德宏": "LUM",
    "鄂尔多斯": "DSN",
    "额济纳旗": "EJN",
    "恩施": "ENH",
    "二连浩特": "ERL",
    "福州": "FOC",
    "阜阳": "FUG",
    "佛山": "FUO",
    "抚远": "FYJ",
    "广州": "CAN",
    "广汉": "GHN",
    "格尔木": "GOQ",
    "广元": "GYS",
    "固原": "GYU",
    "赣州": "KOW",
    "贵阳": "KWE",
    "桂林": "KWL",
    "光化": "LHK",
    "红原": "AHJ",
    "海口": "HAK",
    "河池": "HCJ",
    "邯郸": "HDG",
    "黑河": "HEK",
    "呼和浩特": "HET",
    "合肥": "HFE",
    "杭州": "HGH",
    "淮安": "HIA",
    "怀化": "HJJ",
    "海拉尔": "HLD",
    "哈密市": "HMI",
    "哈尔滨": "HRB",
    "和田市": "HTN",
    "汉中": "HZG",
    "黄山": "TXN",
    "景德镇": "JDZ",
    "加格达奇": "JGD",
    "嘉峪关": "JGN",
    "井冈山": "JGS",
    "金昌": "JIC",
    "九江": "JIU",
    "晋江": "JJN",
    "佳木斯": "JMU",
    "济宁": "JNG",
    "锦州": "JNZ",
    "鸡西": "JXA",
    "九寨沟": "JZH",
    "揭阳": "SWA",
    "济南": "TNA",
    "库车": "KCA",
    "康定": "KGT",
    "喀什市": "KHG",
    "凯里": "KJH",
    "喀纳斯": "KJI",
    "昆明": "KMG",
    "库尔勒": "KRL",
    "克拉玛依": "KRY",
    "黎平": "HZH",
    "龙岩": "LCX",
    "兰州": "LHW",
    "梁平": "LIA",
    "丽江": "LJG",
    "荔波": "LLB",
    "吕梁": "LLV",
    "临沧": "LNJ",
    "拉萨": "LXA",
    "林西": "LXI",
    "洛阳": "LYA",
    "连云港": "LYG",
    "临沂": "LYI",
    "柳州": "LZH",
    "泸州": "LZO",
    "林芝": "LZY",
    "牡丹江": "MDG",
    "绵阳": "MIG",
    "梅州": "MXZ",
    "满洲里": "NZH",
    "漠河": "OHE",
    "南昌": "KHN",
    "南充": "NAO",
    "宁波": "NGB",
    "南京": "NKG",
    "那拉提": "NLT",
    "南宁": "NNG",
    "南阳": "NNY",
    "南通": "NTG",
    "攀枝花": "PZI",
    "普洱": "SYM",
    "且末": "IQM",
    "庆阳": "IQN",
    "黔江": "JIQ",
    "衢州": "JUZ",
    "齐齐哈尔": "NDG",
    "秦皇岛": "SHP",
    "青岛": "TAO",
    "日喀则": "RKZ",
    "神农架": "HPG",
    "上海": "SHA",
    "沈阳": "SHE",
    "沙市": "SHS",
    "石家庄": "SJW",
    "三亚": "SYX",
    "深圳": "SZX",
    "上海(浦东)": "SHA",
    "上海(虹桥)": "SHA",
    "台州": "HYN",
    "塔城": "TCG",
    "腾冲": "TCZ",
    "铜仁市": "TEN",
    "通辽": "TGO",
    "天水": "THQ",
    "吐鲁番": "TLQ",
    "通化": "TNH",
    "天津": "TSN",
    "唐山": "TVS",
    "太原": "TYN",
    "乌兰浩特": "HLH",
    "乌鲁木齐": "URC",
    "潍坊": "WEF",
    "威海": "WEH",
    "文山县": "WNH",
    "温州": "WNZ",
    "乌海": "WUA",
    "武汉": "WUH",
    "武夷山": "WUS",
    "无锡": "WUX",
    "梧州": "WUZ",
    "万州": "WXN",
    "兴义": "ACX",
    "夏河": "GXH",
    "西双版纳": "JHG",
    "襄阳": "XFN",
    "西昌": "XIC",
    "锡林浩特": "XIL",
    "西安": "SIA",
    "厦门": "XMN",
    "西宁": "XNN",
    "徐州": "XUZ",
    "延安": "ENY",
    "银川": "INC",
    "伊春": "LDS",
    "永州": "LLF",
    "榆林": "UYN",
    "宜宾": "YBP",
    "运城": "YCU",
    "宜春": "YIC",
    "宜昌": "YIH",
    "伊宁市": "YIN",
    "义乌": "YIW",
    "延吉": "YNJ",
    "烟台": "YNT",
    "盐城": "YNZ",
    "扬州": "YTY",
    "玉树县": "YUS",
    "郑州": "CGO",
    "张家界": "DYG",
    "舟山": "HSN",
    "张掖": "YZY",
    "昭通": "ZAT",
    "中山": "ZGN",
    "湛江": "ZHA",
    "中卫": "ZHY",
    "张家口": "ZQZ",
    "珠海": "ZUH",
    "遵义": "ZYI",
};
process.setMaxListeners(0);
require('events').EventEmitter.prototype._maxListeners = 100;
function requestPage(fromCity, toCity, date, needMap, next) {
    var from, to
    if (needMap) {
        from = nameMap[fromCity];
        to = nameMap[toCity];
    }
    else {
        from = fromCity;
        to = toCity;
    }
    console.log(date + " : " + from + "->" + to);
    var path = '/domesticsearch/search/SearchFirstRouteFlights?DCity1=' + from + '&ACity1=' + to + '&SearchType=S&DDate1=' + date + '&rk=8.843679681885988163816&CK=B4E3E673CBBC06431E4DB4024A6929E4&r=0.31573024241846829838819';
    var options = {
        host: 'flights.ctrip.com',
        port: 80,
        path: path,
        method: 'GET',
        headers: {
            'Referer': 'http://flights.ctrip.com/booking/BJS-CTU-day-1.html',
            'Cookie': '_abtest_userid=70a2bf40-d3d5-4723-8983-5433eda4dd93; __gads=ID=5d6c16bbc4b0a90b:T=1418104796:S=ALNI_MbH82jxK7pQ_sOuaSCxhqhBy_l0GA; _abtest_=39775403-8f05-4735-ba06-daa3dfc85e53; AHeadUserInfo=VipGrade=0&UserName=&NoReadMessageCount=3&U=2A9E97D806ED86212B4033478060C59D; login_type=0; login_uid=4094CC387DC6D53AABC32C6AA81BB5D7D6EB5C4AC60513A3CBAC0E91D1489F43; Session=smartlinkcode=U130026&smartlinklanguage=zh&SmartLinkKeyWord=&SmartLinkQuary=&SmartLinkHost=; __utma=1.1773977820.1418104800.1437963956.1437963956.1; __utmz=1.1437963956.1.1.utmcsr=baidu|utmccn=(organic)|utmcmd=organic; Customer=HAL=ctrip_gb; ASP.NET_SessionSvc=MTAuMTUuMTM2LjM0fDkwOTB8b3V5YW5nfGRlZmF1bHR8MTQzNjI2MzY3NTgxOQ; appFloatCnt=7; _bfa=1.1418104792650.4a3awg.1.1437984025709.1437986185785.9.44; _bfs=1.1; _ga=GA1.2.1773977820.1418104800; _gat=1; __zpspc=9.8.1437986188.1437986188.1%232%7Cwww.baidu.com%7C%7C%7C%7C%23; _jzqco=%7C%7C%7C%7C1437984044838%7C1.480801098.1418104800375.1437984106210.1437986188893.1437984106210.1437986188893.undefined.0.0.20.20; _bfi=p1%3D101027%26p2%3D101027%26v1%3D44%26v2%3D43; FD_SearchHistorty={"type":"S","data":"S%24%u5317%u4EAC%28BJS%29%24BJS%242015-07-29%24%u6210%u90FD%28CTU%29%24CTU"}'
        },
        timeout: 120000

    };
    var iconv = require("iconv-lite");

    function sendRequest(options, onResult) {
        var prot = options.port == 443 ? https : http;
        var req = prot.request(options, function (res) {

            var buffers = [], size = 0;
            console.log(options.host + ':' + res.statusCode);

            res.on('data', function (chunk) {
                buffers.push(chunk);
                size += chunk.length;

            });

            res.on('end', function () {
                var buffer = new Buffer(size), pos = 0;
                for (var i = 0, l = buffers.length; i < l; i++) {
                    buffers[i].copy(buffer, pos);
                    pos += buffers[i].length;
                }
                var output = iconv.decode(buffer, 'GB2312');

                var obj = JSON.parse(output);
                onResult(res.statusCode, obj);
            });
            res.on('timeout', function () {
                console.log("timeout");
                onResult(res.statusCode, undefined);
            });
        });

        req.on('error', function (err) {
            console.log(err);
            onResult(0, undefined);
        });

        req.on('socket', function (socket) {
            socket.setTimeout(60000);
            socket.on('timeout', function () {
                req.abort();
            });
        });

        req.end();
    };

    sendRequest(options, function (status, content) {
        try {
            if (content)
                handler.handle(content);
        }
        catch (e) {
        }
        if (content)
            next();
        else
            next(from, to)
    });
}

var dates = ["2015-08-08", "2015-08-09", "2015-08-10", "2015-08-11", "2015-08-12", "2015-08-13", "2015-08-14", "2015-08-15"];
db.open(function () {
    function crawleOneDay(di) {
        var date = dates[di];
        var i = 5;

        function next(from, to) {
            if (from && to) {
                requestPage(from, to, date, false, next);
            }
            else {

                if (i < flightList.length) {
                    console.log("Num:  " + i + "/" + flightList.length);
                    requestPage(flightList[i][0], flightList[i][1], date, true, next);
                    i++;
                }
                else {
                    if (di + 1 < dates.length)
                        crawleOneDay(di + 1);
                }
            }
        }

        requestPage(flightList[0][0], flightList[0][1], date, true, next);
        requestPage(flightList[1][0], flightList[1][1], date, true, next);
        requestPage(flightList[2][0], flightList[2][1], date, true, next);
        requestPage(flightList[3][0], flightList[3][1], date, true, next);
        requestPage(flightList[4][0], flightList[4][1], date, true, next);
    }
    crawleOneDay(0);

});


